FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX62N/RX62N_PWM_MTU.c
/*-------------------------------------------------------------------------*
 * File:  RX62N_PWM_MTU.c
 *-------------------------------------------------------------------------*
 * Description:
 *      HAL implementation of the RX62N PWM Interface using the 
 *		Multi-Function Timer Pulse Unit 2 (MTU2).
 *
 * Implementation:
 *      All MTUs are included accept MTU5 in this driver due to different
 *		Functionality.
 *		
 *		Each MTU can be enabled by it's config macro, UEZ_ENABLE_PWM_MTUx,
 *		where x is the MTU channel
 *
 *		If a callback methods are defined, PWM output is automatically  
 *		disabled and the callback methods are responsible for all output
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2010 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZLicense.txt or visit http://www.teamfdi.com/uez for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(tm) to your own hardware!  |
 *    |             We can get you up and running fast!               |
 *    |      See http://www.teamfdi.com/uez for more details.         |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include <uEZTypes.h>
#include <uEZProcessor.h>
#include <HAL/PWM.h>
#include <HAL/GPIO.h>
#include <HAL/Interrupt.h>
#include <Source/Processor/Renesas/RX62N/RXToolset/iodefine.h>
#include "RX62N_PWM_MTU.h"

/*---------------------------------------------------------------------------*
 * Defines:
 *---------------------------------------------------------------------------*/
#define TSYRA	MTUA.TSYR.BYTE
#define TSYRB	MTUB.TSYR.BYTE
#define TSTRA	MTUA.TSTR.BYTE
#define TSTRB	MTUB.TSTR.BYTE

#define MSTP_MTUA_BIT	9
#define MSTP_MTUB_BIT	8

#define CST0_BIT	0
#define CST1_BIT	1
#define CST2_BIT	2
#define CST3_BIT	6
#define CST4_BIT	7

/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
typedef struct {
				 TUInt8		iMTU_Idx;	// MTU Index 0-10
				 TUInt8 	iMSTPBit;	// MSTP bit number
    __evenaccess TVUInt8 	*iTCR;		// Timer Control Reg
				 TUInt8		iNumOutputs;// Number of MTU outputs. (2 or 4)
    __evenaccess TVUInt8 	*iTMDR;		// Timer Mode Reg
    __evenaccess TVUInt8 	*iTIORH;	// Timer I/O Control Reg (IOA & IOB)
    __evenaccess TVUInt8 	*iTIORL;	// Timer I/O Control Reg (IOC & IOD)
	__evenaccess TVUInt8 	*iTIER;		// Interrupt Enable Reg
	__evenaccess TVUInt16	*iTGR[4];		
	__evenaccess TVUInt8 	*iTSTR;		// Timer Start Reg (TSTRA or TSTRB)
				 TUInt8		iCSTBit;	// Start Bit (CSTn_BIT)
	__evenaccess TVUInt8 	*iTSYR;		// Sync Reg (TSYRA or TSYRB)
				 TUInt8		iVECT[4];
				 const char *iVectName[4];
				 TFPtr      iVectISR[4];
} T_RX62N_MTU_Info;

typedef void (*T_MTUCallback)(void *aCallbackWorkspace);

typedef struct {
    const HAL_PWM *iHAL;
    TUInt32 iPeriod;
    const T_RX62N_MTU_Info *iInfo;
	T_MTUCallback iMatchCallback[4];
	void *iMatchCallbackWorkspace[4];
	T_irqPriority iISRPriority;
} T_RX62N_MTU_Workspace;

/*---------------------------------------------------------------------------*
 * Globals:
 *---------------------------------------------------------------------------*/
T_RX62N_MTU_Workspace *G_workspaceMTU0 = 0;
extern const T_RX62N_MTU_Info RX62N_MTU0_Info;

T_RX62N_MTU_Workspace *G_workspaceMTU1 = 0;
extern const T_RX62N_MTU_Info RX62N_MTU1_Info;

T_RX62N_MTU_Workspace *G_workspaceMTU2 = 0;
extern const T_RX62N_MTU_Info RX62N_MTU2_Info;

T_RX62N_MTU_Workspace *G_workspaceMTU3 = 0;
extern const T_RX62N_MTU_Info RX62N_MTU3_Info;

T_RX62N_MTU_Workspace *G_workspaceMTU4 = 0;
extern const T_RX62N_MTU_Info RX62N_MTU4_Info;

T_RX62N_MTU_Workspace *G_workspaceMTU6 = 0;
extern const T_RX62N_MTU_Info RX62N_MTU6_Info;

T_RX62N_MTU_Workspace *G_workspaceMTU7 = 0;
extern const T_RX62N_MTU_Info RX62N_MTU7_Info;

T_RX62N_MTU_Workspace *G_workspaceMTU8 = 0;
extern const T_RX62N_MTU_Info RX62N_MTU8_Info;

T_RX62N_MTU_Workspace *G_workspaceMTU9 = 0;
extern const T_RX62N_MTU_Info RX62N_MTU9_Info;

T_RX62N_MTU_Workspace *G_workspaceMTU10 = 0;
extern const T_RX62N_MTU_Info RX62N_MTU10_Info;


/*---------------------------------------------------------------------------*
 * Interrupt Routines:
 *---------------------------------------------------------------------------*/
void MTUCallback(T_RX62N_MTU_Workspace *p, TUInt8 aIndex)
{
    p->iMatchCallback[aIndex](p->iMatchCallbackWorkspace[aIndex]);
}

//	MTU0 Interrupt Routines
IRQ_ROUTINE(MTU0A_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU0, 0);
    IRQ_END();
}
IRQ_ROUTINE(MTU0B_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU0, 1);
    IRQ_END();
}
IRQ_ROUTINE(MTU0C_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU0, 2);
    IRQ_END();
}
IRQ_ROUTINE(MTU0D_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU0, 3);
    IRQ_END();
}

//	MTU1 Interrupt Routines
IRQ_ROUTINE(MTU1A_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU1, 0);
    IRQ_END();
}
IRQ_ROUTINE(MTU1B_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU1, 1);
    IRQ_END();
}

//	MTU2 Interrupt Routines
IRQ_ROUTINE(MTU2A_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU2, 0);
    IRQ_END();
}
IRQ_ROUTINE(MTU2B_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU2, 1);
    IRQ_END();
}

//	MTU3 Interrupt Routines
IRQ_ROUTINE(MTU3A_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU3, 0);
    IRQ_END();
}
IRQ_ROUTINE(MTU3B_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU3, 1);
    IRQ_END();
}
IRQ_ROUTINE(MTU3C_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU3, 2);
    IRQ_END();
}
IRQ_ROUTINE(MTU3D_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU3, 3);
    IRQ_END();
}

