FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX62N/RX62N_PWM_MTU.c
//	MTU4 Interrupt Routines
IRQ_ROUTINE(MTU4A_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU4, 0);
    IRQ_END();
}
IRQ_ROUTINE(MTU4B_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU4, 1);
    IRQ_END();
}
IRQ_ROUTINE(MTU4C_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU4, 2);
    IRQ_END();
}
IRQ_ROUTINE(MTU4D_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU4, 3);
    IRQ_END();
}

//	MTU6 Interrupt Routines
IRQ_ROUTINE(MTU6A_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU6, 0);
    IRQ_END();
}
IRQ_ROUTINE(MTU6B_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU6, 1);
    IRQ_END();
}
IRQ_ROUTINE(MTU6C_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU6, 2);
    IRQ_END();
}
IRQ_ROUTINE(MTU6D_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU6, 3);
    IRQ_END();
}

//	MTU7 Interrupt Routines
IRQ_ROUTINE(MTU7A_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU7, 0);
    IRQ_END();
}
IRQ_ROUTINE(MTU7B_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU7, 1);
    IRQ_END();
}

//	MTU8 Interrupt Routines
IRQ_ROUTINE(MTU8A_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU8, 0);
    IRQ_END();
}
IRQ_ROUTINE(MTU8B_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU8, 1);
    IRQ_END();
}

//	MTU9 Interrupt Routines
IRQ_ROUTINE(MTU9A_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU9, 0);
    IRQ_END();
}
IRQ_ROUTINE(MTU9B_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU9, 1);
    IRQ_END();
}
IRQ_ROUTINE(MTU9C_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU9, 2);
    IRQ_END();
}
IRQ_ROUTINE(MTU9D_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU9, 3);
    IRQ_END();
}

//	MTU10 Interrupt Routines
IRQ_ROUTINE(MTU10A_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU10, 0);
    IRQ_END();
}
IRQ_ROUTINE(MTU10B_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU10, 1);
    IRQ_END();
}
IRQ_ROUTINE(MTU10C_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU10, 2);
    IRQ_END();
}
IRQ_ROUTINE(MTU10D_ISR)
{
    IRQ_START();
    MTUCallback(G_workspaceMTU10, 3);
    IRQ_END();
}


/*---------------------------------------------------------------------------*
 * Routine:  RX62N_PWM_MTU_SetMaster
 *---------------------------------------------------------------------------*
 * Description:
 *      PWM is going to start -- chip select enabled for device
 * Outputs:
 *      void *aWorkspace        -- Workspace for PWM
 *      TUInt32 aPeriod         -- Number of Fpclk intervals per period
 *      TUInt8 aMatchRegister   -- Which register is used for master counter
 *---------------------------------------------------------------------------*/
static T_uezError RX62N_PWM_MTU_SetMaster(
        void *aWorkspace, 
        TUInt32 aPeriod,
        TUInt8 aMatchRegister)
{
    T_RX62N_MTU_Workspace *p = (T_RX62N_MTU_Workspace *)aWorkspace;
    const T_RX62N_MTU_Info *p_info = p->iInfo;

	if(aMatchRegister >= p_info->iNumOutputs)
		return UEZ_ERROR_ILLEGAL_ARGUMENT;

    // Ensure MTU is on
	SYSTEM.MSTPCRA.LONG &= ~(1<<p_info->iMSTPBit);	// MSTP(MTUx) = 0;    
    
    // Ensure it is stopped
    *p_info->iTSTR &= ~(1<<p_info->iCSTBit); 	// CST = 0;

	// Set clear control bit to this match register
	if(aMatchRegister == 0)
		*p_info->iTCR = 1 << 5;	
	else if(aMatchRegister == 1)
		*p_info->iTCR = 2 << 5;
	else if(aMatchRegister == 2)
		*p_info->iTCR = 5 << 5;
	else if(aMatchRegister == 3)
		*p_info->iTCR = 6 << 5;
	
	*p_info->iTCR |= 0 << 3; 		// Clock on rising edge
	*p_info->iTCR |= 1 << 0,		// PCLK/4, for now
	    
    *p_info->iTMDR = 2 << 0;		// PWM mode 1: TMDR.MD = 2

	aPeriod /= 2; // Adjust Fcclk to Fpclk
	
	// Set Period
	*p_info->iTGR[aMatchRegister] = (aPeriod/4);
	
	// Configure Interrupt if Needed
	if( p->iMatchCallback[aMatchRegister] &&
		!InterruptIsRegistered(p_info->iVECT[aMatchRegister]) )
	{
		InterruptRegister(
			p_info->iVECT[aMatchRegister],
			p_info->iVectISR[aMatchRegister],
			p->iISRPriority,
        	p_info->iVectName[aMatchRegister]);
			
		*p_info->iTIER |= 1 << aMatchRegister;
	}
	
	// Set start bit
	*p_info->iTSTR |= (1<<p_info->iCSTBit); 	// CST = 1;
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_PWM_MTU_SetMatchRegister
 *---------------------------------------------------------------------------*
 * Description:
 *      Configure one of the several match registers for this PWM bank.
 * Outputs:
 *      void *aWorkspace        -- PWM's workspace
 *      TUInt8 aMatchRegister   -- Index to match register (0-7)
 *      TUInt32 aMatchPoint     -- Number of PWM cycles until match
 *      TBool aDoInterrupt      -- ETrue if want an interrupt, else EFalse
 *                                  (NOTE: Interrupts currently not 
 *                                  implemented)
 *      TBool aDoCounterReset   -- ETrue if counter for this PWM bank is
 *                                  to be reset on match.
 *      TBool aDoStop           -- ETrue if counter is to be stopped
 *                                  when match occurs.
 *---------------------------------------------------------------------------*/
static T_uezError RX62N_PWM_MTU_SetMatchRegister(
        void *aWorkspace, 
        TUInt8 aMatchRegister,
        TUInt32 aMatchPoint,
        TBool aDoInterrupt,
        TBool aDoCounterReset,
        TBool aDoStop)
{	
	T_RX62N_MTU_Workspace *p = (T_RX62N_MTU_Workspace *)aWorkspace;
    const T_RX62N_MTU_Info *p_info = p->iInfo;
	
	if(aMatchRegister >= p_info->iNumOutputs)
		return UEZ_ERROR_ILLEGAL_ARGUMENT;
	
	aMatchPoint /= 2; // Adjust Fcclk to Fpclk
	
	*p_info->iTGR[aMatchRegister] = (aMatchPoint/4);
	
	if( p->iMatchCallback[aMatchRegister] &&
		!InterruptIsRegistered(p_info->iVECT[aMatchRegister]) )
	{
		InterruptRegister(
			p_info->iVECT[aMatchRegister],
			p_info->iVectISR[aMatchRegister],
			p->iISRPriority,
        	p_info->iVectName[aMatchRegister]);
			
		*p_info->iTIER |= 1 << aMatchRegister;
	}
	
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_PWM_MTU_EnableSingleEdgeOutput
 *---------------------------------------------------------------------------*
 * Description:
 *      PWM is going to have a single edge output (high until matches, then
 *      low, reset counter goes back to high).
 * Inputs:
 *      void *aWorkspace        -- PWM's workspace
 *      TUInt8 aMatchRegister   -- Point in Fpclk cycles where PWM switches
 * Outputs:
 *      T_uezError              -- UEZ_ERROR_NONE
 *---------------------------------------------------------------------------*/
static T_uezError RX62N_PWM_MTU_EnableSingleEdgeOutput(
        void *aWorkspace,
        TUInt8 aMatchRegister)
{
    T_RX62N_MTU_Workspace *p = (T_RX62N_MTU_Workspace *)aWorkspace;
    const T_RX62N_MTU_Info *p_info = p->iInfo;
	TUInt8 i;
	
