FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX62N/RX62N_PWM_MTU.c
	if(aMatchRegister >= p_info->iNumOutputs)
		return UEZ_ERROR_ILLEGAL_ARGUMENT;

	// This needs to be changed once there is a rx62n timer driver
	// - for now, if a callback is set, output is software controlled
	if( p->iMatchCallback[aMatchRegister] &&
		!InterruptIsRegistered(p_info->iVECT[aMatchRegister]) )
	{
		InterruptRegister(
			p_info->iVECT[aMatchRegister],
			p_info->iVectISR[aMatchRegister],
			p->iISRPriority,
        	p_info->iVectName[aMatchRegister]);
			
		*p_info->iTIER |= 1 << aMatchRegister;
	}
	
	if(!InterruptIsRegistered(p_info->iVECT[aMatchRegister]))
	{
		if(aMatchRegister == 0)
			*p_info->iTIORH |= 5;
		else if(aMatchRegister == 1)
			*p_info->iTIORH |= (1<<5);
		else if(aMatchRegister == 2)
			*p_info->iTIORL |= 5;
		else if(aMatchRegister == 3)
			*p_info->iTIORL |= (1<<5);			
	}
	else
	{
		// Enable any registered interrupts
		for(i=0; i<p_info->iNumOutputs; i++)
		{
			if(InterruptIsRegistered(p_info->iVECT[i]))
				InterruptEnable(p_info->iVECT[i]);
		}
	}

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_PWM_MTU_DisableOutput
 *---------------------------------------------------------------------------*
 * Description:
 *      PWM is going to have a single edge output (high until matches, then
 *      low, reset counter goes back to high).
 * Inputs:
 *      void *aWorkspace        -- PWM's workspace
 *      TUInt8 aMatchRegister   -- Point in Fpclk cycles where PWM switches
 * Outputs:
 *      T_uezError              -- UEZ_ERROR_NONE
 *---------------------------------------------------------------------------*/
static T_uezError RX62N_PWM_MTU_DisableOutput(
        void *aWorkspace,
        TUInt8 aMatchRegister)
{
    T_RX62N_MTU_Workspace *p = (T_RX62N_MTU_Workspace *)aWorkspace;
	const T_RX62N_MTU_Info *p_info = p->iInfo;
	TUInt8 i;
	
	if(aMatchRegister >= p_info->iNumOutputs)
		return UEZ_ERROR_ILLEGAL_ARGUMENT;
	
	if(!InterruptIsRegistered(p_info->iVECT[aMatchRegister]))
	{
		if(aMatchRegister == 0)
			*p_info->iTIORH &= ~5;
		else if(aMatchRegister == 1)
			*p_info->iTIORH &= ~(1<<5);
		else if(aMatchRegister == 2)
			*p_info->iTIORL &= ~5;
		else if(aMatchRegister == 3)
			*p_info->iTIORL &= ~(1<<5);			
	}
	else
	{
		// Enable any registered interrupts
		for(i=0; i<p_info->iNumOutputs; i++)
		{
			if(InterruptIsRegistered(p_info->iVECT[i]))
				InterruptDisable(p_info->iVECT[i]);
		}
	}

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_PWM_MTU_SetMatchCallback
 *---------------------------------------------------------------------------*
 * Description:
 *      Set the callback function for a Match Register
 * Inputs:
 *      void *aWorkspace        -- PWM's workspace
 *		TUInt8 aMatchRegister	-- The match register to attach callback
 *      void *aCallback   		-- Pointer to the callback method
 *      void *aCallbackWorkspace-- Workspace for this callback
 * Outputs:
 *      T_uezError              -- UEZ_ERROR_NONE
 *---------------------------------------------------------------------------*/
static T_uezError RX62N_PWM_MTU_SetMatchCallback(
        void *aWorkspace,
        TUInt8 aMatchRegister,
		void (*aCallback)(void *),
		void *aCallbackWorkspace)
{
    T_RX62N_MTU_Workspace *p = (T_RX62N_MTU_Workspace *)aWorkspace;
	
	if(aMatchRegister < 4) {
		p->iMatchCallback[aMatchRegister] = aCallback;
        p->iMatchCallbackWorkspace[aMatchRegister] = aCallbackWorkspace;
	} else {
		return UEZ_ERROR_ILLEGAL_ARGUMENT;
	}
		
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_PWM_MTU_MTUx_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup a RX62N PWM MTU for the given global workspace and info table.
 *		This routine is designed to be used by the specific MTU0-MTU10 initial
 *		routines below.
 * Inputs:
 *      void *aW                    -- Particular PWM workspace
 *		T_RX62N_MTU_Workspace *aWorkspaceMTUx
 *									-- pointer to a global RX62N MTU workspace
 *		RX62N_MTU0_Info *aMTUx_Info -- pointer to a global MTU into table
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_PWM_MTUx_InitializeWorkspace(
	void *aWorkspace,
	const T_RX62N_MTU_Info *aMTUx_Info)
{
	T_RX62N_MTU_Workspace *p = (T_RX62N_MTU_Workspace *)aWorkspace;
	TUInt8 i;

	// Setup the connecting between workspace and info block
    p->iInfo = aMTUx_Info;
    p->iISRPriority = INTERRUPT_PRIORITY_HIGH;

    // Ensure the callbacks are off
	for(i=0; i < aMTUx_Info->iNumOutputs; i++) {
		p->iMatchCallback[i] = 0;
        p->iMatchCallbackWorkspace[i] = 0;
	}

    return UEZ_ERROR_NONE;
}

T_uezError RX62N_PWM_MTUx_Configure(void *aWorkspace, T_irqPriority aPriority)
{
    T_RX62N_MTU_Workspace *p = (T_RX62N_MTU_Workspace *)aWorkspace;
    p->iISRPriority = aPriority;
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Initialize Workspace Routines
 *---------------------------------------------------------------------------*/
T_uezError RX62N_PWM_MTU0_InitializeWorkspace(void *aWorkspace)
{
    G_workspaceMTU1 = aWorkspace;
    return RX62N_PWM_MTUx_InitializeWorkspace(
		aWorkspace,
		&RX62N_MTU0_Info);
}

T_uezError RX62N_PWM_MTU1_InitializeWorkspace(void *aWorkspace)
{
    G_workspaceMTU1 = aWorkspace;
    return RX62N_PWM_MTUx_InitializeWorkspace(
		aWorkspace,
		&RX62N_MTU1_Info);
}

T_uezError RX62N_PWM_MTU2_InitializeWorkspace(void *aWorkspace)
{
    G_workspaceMTU2 = aWorkspace;
    return RX62N_PWM_MTUx_InitializeWorkspace(
		aWorkspace,
		&RX62N_MTU2_Info);
}

T_uezError RX62N_PWM_MTU3_InitializeWorkspace(void *aWorkspace)
{
    G_workspaceMTU3 = aWorkspace;
    return RX62N_PWM_MTUx_InitializeWorkspace(
		aWorkspace,
		&RX62N_MTU3_Info);
}

T_uezError RX62N_PWM_MTU4_InitializeWorkspace(void *aWorkspace)
{
    G_workspaceMTU4 = aWorkspace;
    return RX62N_PWM_MTUx_InitializeWorkspace(
		aWorkspace,
		&RX62N_MTU4_Info);
}

