FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX62N/RX62N_PWM_MTU.c
T_uezError RX62N_PWM_MTU6_InitializeWorkspace(void *aWorkspace)
{
    G_workspaceMTU6 = aWorkspace;
    return RX62N_PWM_MTUx_InitializeWorkspace(
		aWorkspace,
		&RX62N_MTU6_Info);
}

T_uezError RX62N_PWM_MTU7_InitializeWorkspace(void *aWorkspace)
{
    G_workspaceMTU7 = aWorkspace;
    return RX62N_PWM_MTUx_InitializeWorkspace(
		aWorkspace,
		&RX62N_MTU7_Info);
}

T_uezError RX62N_PWM_MTU8_InitializeWorkspace(void *aWorkspace)
{
    G_workspaceMTU8 = aWorkspace;
    return RX62N_PWM_MTUx_InitializeWorkspace(
		aWorkspace,
		&RX62N_MTU8_Info);
}

T_uezError RX62N_PWM_MTU9_InitializeWorkspace(void *aWorkspace)
{
    G_workspaceMTU9 = aWorkspace;
    return RX62N_PWM_MTUx_InitializeWorkspace(
		aWorkspace,
		&RX62N_MTU9_Info);
}

T_uezError RX62N_PWM_MTU10_InitializeWorkspace(void *aWorkspace)
{
    G_workspaceMTU10 = aWorkspace;
    return RX62N_PWM_MTUx_InitializeWorkspace(
		aWorkspace,
		&RX62N_MTU10_Info);
}

/*---------------------------------------------------------------------------*
 * HAL Interfaces
 *---------------------------------------------------------------------------*/
const HAL_PWM PWM_RX62N_MTU0_Interface = {
    "PWM:RX62N:MTU0",
    0x0100,
    RX62N_PWM_MTU0_InitializeWorkspace,
    sizeof(T_RX62N_MTU_Workspace),

    RX62N_PWM_MTU_SetMaster,
    RX62N_PWM_MTU_SetMatchRegister,
    RX62N_PWM_MTU_EnableSingleEdgeOutput,
    RX62N_PWM_MTU_DisableOutput,
	RX62N_PWM_MTU_SetMatchCallback,
};

const HAL_PWM PWM_RX62N_MTU1_Interface = {
    "PWM:RX62N:MTU1",
    0x0100,
    RX62N_PWM_MTU1_InitializeWorkspace,
    sizeof(T_RX62N_MTU_Workspace),

    RX62N_PWM_MTU_SetMaster,
    RX62N_PWM_MTU_SetMatchRegister,
    RX62N_PWM_MTU_EnableSingleEdgeOutput,
    RX62N_PWM_MTU_DisableOutput,
	RX62N_PWM_MTU_SetMatchCallback,
};

const HAL_PWM PWM_RX62N_MTU2_Interface = {
    "PWM:RX62N:MTU2",
    0x0100,
    RX62N_PWM_MTU2_InitializeWorkspace,
    sizeof(T_RX62N_MTU_Workspace),

    RX62N_PWM_MTU_SetMaster,
    RX62N_PWM_MTU_SetMatchRegister,
    RX62N_PWM_MTU_EnableSingleEdgeOutput,
    RX62N_PWM_MTU_DisableOutput,
	RX62N_PWM_MTU_SetMatchCallback,
};

const HAL_PWM PWM_RX62N_MTU3_Interface = {
    "PWM:RX62N:MTU3",
    0x0100,
    RX62N_PWM_MTU3_InitializeWorkspace,
    sizeof(T_RX62N_MTU_Workspace),

    RX62N_PWM_MTU_SetMaster,
    RX62N_PWM_MTU_SetMatchRegister,
    RX62N_PWM_MTU_EnableSingleEdgeOutput,
    RX62N_PWM_MTU_DisableOutput,
	RX62N_PWM_MTU_SetMatchCallback,
};

const HAL_PWM PWM_RX62N_MTU4_Interface = {
    "PWM:RX62N:MTU4",
    0x0100,
    RX62N_PWM_MTU4_InitializeWorkspace,
    sizeof(T_RX62N_MTU_Workspace),

    RX62N_PWM_MTU_SetMaster,
    RX62N_PWM_MTU_SetMatchRegister,
    RX62N_PWM_MTU_EnableSingleEdgeOutput,
    RX62N_PWM_MTU_DisableOutput,
	RX62N_PWM_MTU_SetMatchCallback,
};

const HAL_PWM PWM_RX62N_MTU6_Interface = {
    "PWM:RX62N:MTU6",
    0x0100,
    RX62N_PWM_MTU6_InitializeWorkspace,
    sizeof(T_RX62N_MTU_Workspace),

    RX62N_PWM_MTU_SetMaster,
    RX62N_PWM_MTU_SetMatchRegister,
    RX62N_PWM_MTU_EnableSingleEdgeOutput,
    RX62N_PWM_MTU_DisableOutput,
	RX62N_PWM_MTU_SetMatchCallback,
};

const HAL_PWM PWM_RX62N_MTU7_Interface = {
    "PWM:RX62N:MTU7",
    0x0100,
    RX62N_PWM_MTU7_InitializeWorkspace,
    sizeof(T_RX62N_MTU_Workspace),

    RX62N_PWM_MTU_SetMaster,
    RX62N_PWM_MTU_SetMatchRegister,
    RX62N_PWM_MTU_EnableSingleEdgeOutput,
    RX62N_PWM_MTU_DisableOutput,
	RX62N_PWM_MTU_SetMatchCallback,
};

const HAL_PWM PWM_RX62N_MTU8_Interface = {
    "PWM:RX62N:MTU8",
    0x0100,
    RX62N_PWM_MTU8_InitializeWorkspace,
    sizeof(T_RX62N_MTU_Workspace),

    RX62N_PWM_MTU_SetMaster,
    RX62N_PWM_MTU_SetMatchRegister,
    RX62N_PWM_MTU_EnableSingleEdgeOutput,
    RX62N_PWM_MTU_DisableOutput,
	RX62N_PWM_MTU_SetMatchCallback,
};

const HAL_PWM PWM_RX62N_MTU9_Interface = {
    "PWM:RX62N:MTU9",
    0x0100,
    RX62N_PWM_MTU9_InitializeWorkspace,
    sizeof(T_RX62N_MTU_Workspace),

    RX62N_PWM_MTU_SetMaster,
    RX62N_PWM_MTU_SetMatchRegister,
    RX62N_PWM_MTU_EnableSingleEdgeOutput,
    RX62N_PWM_MTU_DisableOutput,
	RX62N_PWM_MTU_SetMatchCallback,
};

const HAL_PWM PWM_RX62N_MTU10_Interface = {
    "PWM:RX62N:MTU10",
    0x0100,
    RX62N_PWM_MTU10_InitializeWorkspace,
    sizeof(T_RX62N_MTU_Workspace),

    RX62N_PWM_MTU_SetMaster,
    RX62N_PWM_MTU_SetMatchRegister,
    RX62N_PWM_MTU_EnableSingleEdgeOutput,
    RX62N_PWM_MTU_DisableOutput,
	RX62N_PWM_MTU_SetMatchCallback,
};

/*---------------------------------------------------------------------------*
 * Info Tables
 *---------------------------------------------------------------------------*/
const T_RX62N_MTU_Info RX62N_MTU0_Info = {
		0,
		MSTP_MTUA_BIT,
        &MTU0.TCR.BYTE,
		4,	// Num Outputs
        &MTU0.TMDR.BYTE,
        &MTU0.TIORH.BYTE,
        &MTU0.TIORL.BYTE,
		&MTU0.TIER.BYTE,
		{&MTU0.TGRA, &MTU0.TGRB, &MTU0.TGRC, &MTU0.TGRD},
		&TSTRA,
		CST0_BIT,
		&TSYRA,
		{IR_MTU0_TGIA0, IR_MTU0_TGIB0, IR_MTU0_TGIC0, IR_MTU0_TGID0},
		{"MTU0A", "MTU0B","MTU0C","MTU0D"},
		{MTU0A_ISR, MTU0B_ISR, MTU0C_ISR, MTU0D_ISR},
};

const T_RX62N_MTU_Info RX62N_MTU1_Info = {
		1,
		MSTP_MTUA_BIT,
        &MTU1.TCR.BYTE,
		2,	// Num Outputs
        &MTU1.TMDR.BYTE,
        &MTU1.TIOR.BYTE,
        0,
		&MTU1.TIER.BYTE,
		{&MTU1.TGRA, &MTU1.TGRB, 0, 0},
		&TSTRA,
		CST1_BIT,
		&TSYRA,
		{IR_MTU1_TGIA1, IR_MTU1_TGIB1, 0, 0},
		{"MTU1A", "MTU1B", 0, 0},
		{MTU1A_ISR, MTU1B_ISR, 0, 0},
};

const T_RX62N_MTU_Info RX62N_MTU2_Info = {
		2,
		MSTP_MTUA_BIT,
        &MTU2.TCR.BYTE,
		2,	// Num Outputs
        &MTU2.TMDR.BYTE,
        &MTU2.TIOR.BYTE,
        0,
		&MTU2.TIER.BYTE,
		{&MTU2.TGRA, &MTU2.TGRB, 0, 0},
		&TSTRA,
		CST2_BIT,
		&TSYRA,
		{IR_MTU2_TGIA2, IR_MTU2_TGIB2, 0, 0},
        {"MTU2A", "MTU2B", 0, 0},
        {MTU2A_ISR, MTU2B_ISR, 0, 0},
};

const T_RX62N_MTU_Info RX62N_MTU3_Info = {
		3,
		MSTP_MTUA_BIT,
        &MTU3.TCR.BYTE,
		4,	// Num Outputs
        &MTU3.TMDR.BYTE,
        &MTU3.TIORH.BYTE,
        &MTU3.TIORL.BYTE,
		&MTU3.TIER.BYTE,
		{&MTU3.TGRA, &MTU3.TGRB, &MTU3.TGRC, &MTU3.TGRD},
		&TSTRA,
		CST3_BIT,
		&TSYRA,
		{IR_MTU3_TGIA3, IR_MTU3_TGIB3, IR_MTU3_TGIC3, IR_MTU3_TGID3},
		{"MTU3A", "MTU3B","MTU3C","MTU3D"},
		{MTU3A_ISR, MTU3B_ISR, MTU3C_ISR, MTU3D_ISR},
};

const T_RX62N_MTU_Info RX62N_MTU4_Info = {
		4,
		MSTP_MTUA_BIT,
        &MTU4.TCR.BYTE,
		4,	// Num Outputs
        &MTU4.TMDR.BYTE,
        &MTU4.TIORH.BYTE,
        &MTU4.TIORL.BYTE,
		&MTU4.TIER.BYTE,
		{&MTU4.TGRA, &MTU4.TGRB, &MTU4.TGRC, &MTU4.TGRD},
		&TSTRA,
		CST4_BIT,
		&TSYRA,
		{IR_MTU4_TGIA4, IR_MTU4_TGIB4, IR_MTU4_TGIC4, IR_MTU4_TGID4},
        {"MTU4A", "MTU4B","MTU4C","MTU4D"},
        {MTU4A_ISR, MTU4B_ISR, MTU4C_ISR, MTU4D_ISR},
};

const T_RX62N_MTU_Info RX62N_MTU6_Info = {
		6,
		MSTP_MTUB_BIT,
        &MTU6.TCR.BYTE,
		4,	// Num Outputs
        &MTU6.TMDR.BYTE,
        &MTU6.TIORH.BYTE,
        &MTU6.TIORL.BYTE,
		&MTU6.TIER.BYTE,
		{&MTU6.TGRA, &MTU6.TGRB, &MTU6.TGRC, &MTU6.TGRD},
		&TSTRB,
		CST0_BIT,
		&TSYRB,
		{IR_MTU6_TGIA6, IR_MTU6_TGIB6, IR_MTU6_TGIC6, IR_MTU6_TGID6},
		{"MTU6A", "MTU6B", "MTU6C", "MTU6D"},
		{MTU6A_ISR, MTU6B_ISR, MTU6C_ISR, MTU6D_ISR},
};

