FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX62N/RX62N_PWM_MTU.c
const T_RX62N_MTU_Info RX62N_MTU7_Info = {
		7,
		MSTP_MTUB_BIT,
        &MTU7.TCR.BYTE,
		2,	// Num Outputs
        &MTU7.TMDR.BYTE,
        &MTU7.TIOR.BYTE,
        0,
		&MTU7.TIER.BYTE,
		{&MTU7.TGRA, &MTU7.TGRB, 0, 0},
		&TSTRB,
		CST1_BIT,
		&TSYRB,
		{IR_MTU7_TGIA7, IR_MTU7_TGIB7, 0, 0},
		{"MTU7A", "MTU7B", 0, 0},
		{MTU7A_ISR, MTU7B_ISR, 0, 0},
};

const T_RX62N_MTU_Info RX62N_MTU8_Info = {
		8,
		MSTP_MTUB_BIT,
        &MTU8.TCR.BYTE,
		2,	// Num Outputs
        &MTU8.TMDR.BYTE,
        &MTU8.TIOR.BYTE,
        0,
		&MTU8.TIER.BYTE,
		{&MTU8.TGRA, &MTU8.TGRB, 0, 0},
		&TSTRB,
		CST2_BIT,
		&TSYRB,
		{IR_MTU8_TGIA8, IR_MTU8_TGIB8, 0, 0},
        {"MTU8A", "MTU8B", 0, 0},
        {MTU8A_ISR, MTU8B_ISR, 0, 0},
};

const T_RX62N_MTU_Info RX62N_MTU9_Info = {
		9,
		MSTP_MTUB_BIT,
        &MTU9.TCR.BYTE,
		4,	// Num Outputs
        &MTU9.TMDR.BYTE,
        &MTU9.TIORH.BYTE,
        &MTU9.TIORL.BYTE,
		&MTU9.TIER.BYTE,
		{&MTU9.TGRA, &MTU9.TGRB,
		&MTU9.TGRC, &MTU9.TGRD},
		&TSTRB,
		CST3_BIT,
		&TSYRB,
		{IR_MTU9_TGIA9, IR_MTU9_TGIB9,
		 IR_MTU9_TGIC9, IR_MTU9_TGID9},
		{"MTU9A", "MTU9B","MTU9C","MTU9D"},
		{MTU9A_ISR, MTU9B_ISR, MTU9C_ISR, MTU9D_ISR},
};

const T_RX62N_MTU_Info RX62N_MTU10_Info = {
		10,
		MSTP_MTUB_BIT,
        &MTU10.TCR.BYTE,
		4,	// Num Outputs
        &MTU10.TMDR.BYTE,
        &MTU10.TIORH.BYTE,
        &MTU10.TIORL.BYTE,
		&MTU10.TIER.BYTE,
		{&MTU10.TGRA, &MTU10.TGRB, &MTU10.TGRC,
		&MTU10.TGRD},
		&TSTRB,
		CST4_BIT,
		&TSYRB,
		{IR_MTU10_TGIA10, IR_MTU10_TGIB10, 
		 IR_MTU10_TGIC10, IR_MTU10_TGID10},
        {"MTU10A", "MTU10B","MTU10C","MTU10D"},
        {MTU10A_ISR, MTU10B_ISR, MTU10C_ISR, MTU10D_ISR},
};

void RX62N_PWM_MTU0_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("PWM_MTU0", (T_halInterface *)&PWM_RX62N_MTU0_Interface, 0, 0);
}

void RX62N_PWM_MTU1_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("PWM_MTU1", (T_halInterface *)&PWM_RX62N_MTU1_Interface, 0, 0);
}

void RX62N_PWM_MTU2_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("PWM_MTU2", (T_halInterface *)&PWM_RX62N_MTU2_Interface, 0, 0);
}

void RX62N_PWM_MTU3_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("PWM_MTU3", (T_halInterface *)&PWM_RX62N_MTU3_Interface, 0, 0);
}

void RX62N_PWM_MTU4_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("PWM_MTU4", (T_halInterface *)&PWM_RX62N_MTU4_Interface, 0, 0);
}

void RX62N_PWM_MTU5_Require(void)
{
    // Error message
}

void RX62N_PWM_MTU6_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("PWM_MTU6", (T_halInterface *)&PWM_RX62N_MTU6_Interface, 0, 0);
}

void RX62N_PWM_MTU7_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("PWM_MTU7", (T_halInterface *)&PWM_RX62N_MTU7_Interface, 0, 0);
}

void RX62N_PWM_MTU8_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("PWM_MTU8", (T_halInterface *)&PWM_RX62N_MTU8_Interface, 0, 0);
}

void RX62N_PWM_MTU9_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("PWM_MTU9", (T_halInterface *)&PWM_RX62N_MTU9_Interface, 0, 0);
}

void RX62N_PWM_MTU10_Require(void)
{
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("PWM_MTU10", (T_halInterface *)&PWM_RX62N_MTU10_Interface, 0, 0);
}

/*-------------------------------------------------------------------------*
 * End of File:  RX62N_PWM_MTU.c
 *-------------------------------------------------------------------------*/

